[Understand Set Functions in Numpy](https://www.youtube.com/live/jFBpnd0G09o?si=zJ7iBXbGtM1nQlEV&t=3781)

In [8]:
import numpy as np

arr = np.array([1, 2, 3, 4, 5])
arr2 = np.array([3,4,5, 9, 10])
indexes = np.isin(arr, arr2)
print(indexes)
arr[indexes]

[False False  True  True  True]

array([3, 4, 5])

In [ ]:
# np.intersect1d is a function in NumPy that returns the sorted, unique values that are present in both of the input arrays.
# It is useful for finding common elements between two arrays.
a = np.array([ 2, 3, 5, 7])
b = np.array([ 4, 5, 5, 7])
result = np.intersect1d(a, b)
print(result)  # This will output the common elements between a and b.
# The function will return the values that are present in both arrays, which in this case would be [5, 7].
# The result is sorted and unique, meaning that if there are duplicates in the input arrays, they will only appear once in the output.

# np.intersect1d is particularly useful in data analysis and scientific computing when you need to find common elements between datasets or arrays.

In [ ]:
# All excercises related to this in a google collab 
# Exercise -> https://www.youtube.com/live/Ssy1EfK5S-o?si=U-3ZrUzzi7haOEpf&t=3907

In [32]:
# self-join -> https://www.youtube.com/live/Ssy1EfK5S-o?si=rhj0U4eLKqv-31uT&t=5567
# give a suitable example for self-join
# self-join is a join operation where a table is joined with itself. This is useful when you want to compare rows within the same table or when you need to relate data in a hierarchical manner.
# For example, in a table of employees, you might want to find pairs of employees who work in the same department.
# In this case, you would join the employee table with itself on the department column to find all pairs of employees who share the same department.
# This can be done using a self-join, where the table is aliased to create two instances of it, allowing you to compare rows within the same table.
# Example:
import pandas as pd
df_employeeAndComp = pd.DataFrame({
    'Emp_ID': [1, 2, 3, 4],
    'Emp_Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Manager_ID': [None, 1, 1, 2]  # employee 2 & 3 report to Alice, 4 reports to Bob
})
df_employeeAndComp

   Emp_ID Emp_Name  Manager_ID
0       1    Alice         NaN
1       2      Bob         1.0
2       3  Charlie         1.0
3       4    David         2.0

In [31]:
# Self-Join to Get Managers' Names
# We want to add a column showing each employee’s Manager’s Name, by joining the table with itself.
# Self join: left is employee, right is manager
df_with_mgr = df_employeeAndComp.merge(df_employeeAndComp, how='inner',
                       left_on='Manager_ID', right_on='Emp_ID',
                       suffixes=('', '_Manager'))
# suffixes are used to differentiate between the columns from the left and right tables in the merged DataFrame.

# Select relevant columns

df_with_mgr.rename(columns={'Emp_Name_Manager': 'Manager_Name'})

# 🔥 Now we have each employee matched with their manager’s name!

,Emp_ID,Emp_Name,Manager_ID,Emp_ID_Manager,Manager_Name,Manager_ID_Manager
0,2,Bob,1.0,1,Alice,NaN
1,3,Charlie,1.0,1,Alice,NaN
2,4,David,2.0,2,Bob,1.0